Repository: utaschulz1/patent-translation-agent
Catalog: Matecat/HUAW_old/HUAW_old.tmx
Source language: en_us
Languages: de_de

source: [0349] When the apparatus 800 is a source base station, the apparatus 800 may be configured to implement steps performed by the source base station in the methods in the embodiments of the present invention.
de_de: [0349] Sofern es sich bei der Vorrichtung 800 um eine Quellbasisstation handelt, kann die Vorrichtung 800 dazu eingerichtet sein, die von der Quellbasisstation in den Verfahren der Ausführungsformen der vorliegenden Erfindung durchgeführten Schritte auszuführen.

source: For example, the apparatus 800 may perform step 305, step 306, and step 307 in FIG. 3, may further perform step 404, step 405, step 406, step 408, step 409, and step 410 in FIG. 4, may further perform step 504, step 505, step 506, step 508, step 509, and step 510 in FIG. 5, may further perform step 604, step 605, step 606, step 608, step 609, and step 610 in FIG. 6, and may further perform step 706, step 707, and step 708 in FIG. 7. For related features, refer to the foregoing description.
de_de: Beispielsweise kann die Vorrichtung 800 Schritt 305, Schritt 306 und Schritt 307 in Fig. 3 durchführen, ferner Schritt 404, Schritt 405, Schritt 406, Schritt 408, Schritt 409 und Schritt 410 in Fig. 4 durchführen, ferner Schritt 504, Schritt 505, Schritt 506, Schritt 508, Schritt 509 und Schritt 510 in Fig. 5 durchführen, ferner Schritt 604, Schritt 605, Schritt 606, Schritt 608, Schritt 609 und Schritt 610 in Fig. 6 durchführen sowie ferner Schritt 706, Schritt 707 und Schritt 708 in Fig. 7 durchführen. Hinsichtlich der zugehörigen Merkmale sei auf die vorstehende Beschreibung verwiesen.

source: [0350] In this application, function modules may be obtained through division in the terminal based on the foregoing method example.
de_de: [0350] In dieser Anmeldung können Funktionsmodule durch Aufteilung in dem Endgerät basierend auf dem vorgenannten Verfahrensbeispiel erhalten werden.

source: For example, function modules may be obtained through division in correspondence with functions, or two or more functions may be integrated into one processing module.
de_de: Beispielsweise können Funktionsmodule durch Aufteilung entsprechend den Funktionen erhalten werden, oder es können zwei oder mehr Funktionen in einem Verarbeitungsmodul integriert werden.

source: The integrated module may be implemented in a form of hardware, or may be implemented in a form of a software function module.
de_de: Das integrierte Modul kann in Form von Hardware oder in Form eines Software-Funktionsmoduls implementiert sein.

source: It should be noted that, in this application, module division is an example, and is merely logical function division.
de_de: Es sei angemerkt, dass die Modulaufteilung in dieser Anmeldung beispielhaft ist und lediglich eine logische Aufteilung von Funktionen darstellt.

source: During actual implementation, another division manner may be used.
de_de: Bei der tatsächlichen Implementierung kann eine andere Art der Aufteilung zum Einsatz kommen.

source: For example, when function modules are obtained through division in correspondence with functions, FIG. 9 is a schematic diagram of an apparatus.
de_de: Wenn beispielsweise Funktionsmodule durch Aufteilung entsprechend den Funktionen gebildet werden, so ist Fig. 9 eine schematische Darstellung einer Vorrichtung.

source: The apparatus 900 may be the terminal in the foregoing embodiments.
de_de: Bei der Vorrichtung 900 kann es sich um das Endgerät in den vorstehenden Ausführungsformen handeln.

source: The apparatus 900 includes a processing unit 901 and a sending unit 903.
de_de: Die Vorrichtung 900 beinhaltet eine Verarbeitungseinheit 901 und eine Sendeeinheit 903.

source: Optionally, a receiving unit 902 is further included.
de_de: Optional ist ferner eine Empfangseinheit 902 beinhaltet.

source: [0351] During implementation of a connection resume request method,
de_de: [0351] Bei der Implementierung eines Verbindungswiederaufnahmeanforderungsverfahrens

source: the processing unit 901 is configured to generate a message authentication code based on a freshness parameter and an integrity protection key that is of the apparatus, where freshness parameters used to generate message authentication codes at two consecutive times are different; and
de_de: ist die Verarbeitungseinheit 901 konfiguriert, basierend auf einem Aktualitätsparameter und einem Integritätsschutzschlüssel der Vorrichtung einen Nachrichtenauthentifizierungscode zu erzeugen, wobei Aktualitätsparameter, die zu zwei aufeinanderfolgenden Zeitpunkten zur Erzeugung von Nachrichtenauthentifizierungscodes verwendet werden, verschieden sind; und

source: the sending unit 903 is configured to send a connection resume request message to a target base station, where the connection resume request message includes the message authentication code, and the connection resume request message is used to request to resume a radio resource control RRC connection.
de_de: ist die Sendeeinheit 903 konfiguriert, eine Verbindungswiederaufnahmeanforderungsnachricht an eine Zielbasisstation zu senden, wobei die Verbindungswiederaufnahmeanforderungsnachricht den Nachrichtenauthentifizierungscode beinhaltet und die Verbindungswiederaufnahmeanforderungsnachricht dazu dient, die Wiederaufnahme einer Funkressourcensteuerungs-(RRC-)Verbindung anzufordern.

source: [0352] In a possible implementation, the freshness parameter includes a quantity of rejection times, and the quantity of rejection times is used to indicate a quantity of times for which resuming of the RRC connection that the apparatus attempts to perform is rejected.
de_de: [0352] Bei einer möglichen Implementierung beinhaltet der Aktualitätsparameter eine Anzahl von Ablehnungszeiten, und die Anzahl von Ablehnungszeiten wird verwendet, um anzugeben, wie oft die von der Vorrichtung versuchte Wiederaufnahme der RRC-Verbindung abgelehnt wird.

source: [0353] In a possible implementation, the receiving unit 902 is configured to receive a connection resume response message from the target base station, where the connection resume response message is used to instruct the terminal to resume the RRC connection.
de_de: [0353] Bei einer möglichen Implementierung ist die Empfangseinheit 902 konfiguriert, eine Verbindungswiederaufnahmeantwortnachricht von der Zielbasisstation zu empfangen, wobei die Verbindungswiederaufnahmeantwortnachricht dazu verwendet wird, das Endgerät anzuweisen, die RRC-Verbindung wiederaufzunehmen.

source: [0354] In a possible implementation, the connection resume request message further includes an indication parameter, and the indication parameter is used to indicate the freshness parameter.
de_de: [0354] Bei einer möglichen Ausführungsform beinhaltet die Verbindungswiederaufnahmeanforderungsnachricht ferner einen Anzeigeparameter, wobei der Anzeigeparameter dazu verwendet wird, den Aktualitätsparameter anzugeben.

source: [0355] In a possible implementation, the freshness parameter includes a packet data convergence protocol count (PDCP count), and the indication parameter includes some or all bits of the PDCP count.
de_de: [0355] Bei einer möglichen Implementierung beinhaltet der Aktualitätsparameter eine Paketdatenkonvergenzprotokoll-Zählung (PDCP-Zählung), und der Anzeigeparameter beinhaltet einige oder alle Bits der PDCP-Zählung.

source: [0356] It should be understood that the terminal may be configured to implement the steps performed by the terminal in the methods in the embodiments of the present invention.
de_de: [0356] Es versteht sich, dass das Endgerät dazu eingerichtet sein kann, die Schritte durchzuführen, die das Endgerät in den Verfahren der Ausführungsformen der vorliegenden Erfindung ausführt.

source: For related features, refer to the foregoing description.
de_de: Hinsichtlich verwandter Merkmale wird auf die vorstehende Beschreibung verwiesen.

source: [0357] In this application, function modules may be obtained through division in the target base station based on the foregoing method examples.
de_de: [0357] In dieser Anmeldung können Funktionsmodule durch Aufteilung in der Zielbasisstation auf der Grundlage der vorgenannten Verfahrensbeispiele realisiert werden.

source: For example, the function modules may be obtained through division in correspondence with functions, or two or more functions may be integrated into one processing module.
de_de: Beispielsweise können die Funktionsmodule durch Aufteilung entsprechend den Funktionen realisiert werden, oder es können zwei oder mehr Funktionen in einem Verarbeitungsmodul integriert sein.

source: For example, when function modules are obtained through division in correspondence with functions, FIG. 10 is a schematic diagram of an apparatus.
de_de: Wenn beispielsweise Funktionsmodule durch Aufteilung entsprechend den Funktionen gebildet werden, so stellt Fig. 10 eine schematische Darstellung einer Vorrichtung dar.

source: The apparatus 1000 may be the target base station in the foregoing embodiments.
de_de: Die Vorrichtung 1000 kann in den vorstehenden Ausführungsformen die Zielbasisstation sein.

source: The apparatus 1000 includes a receiving unit 1001 and a sending unit 1002.
de_de: Die Vorrichtung 1000 beinhaltet eine Empfangseinheit 1001 und eine Sendeeinheit 1002.

source: [0358] During implementation of a connection resume request method,
de_de: [0358] Bei der Implementierung eines Verbindungswiederaufnahmeanforderungsverfahrens

source: the receiving unit 1001 is configured to receive a connection resume request message from a terminal, where the connection resume request message includes a message authentication code, the connection resume request message is used to request to resume a radio resource control RRC connection, and the message authentication code is generated based on an integrity protection key of the terminal; and
de_de: ist die Empfangseinheit 1001 konfiguriert, eine Verbindungswiederaufnahmeanforderungsnachricht von einem Endgerät zu empfangen, wobei die Verbindungswiederaufnahmeanforderungsnachricht einen Nachrichtenauthentifizierungscode beinhaltet, die Verbindungswiederaufnahmeanforderungsnachricht dazu verwendet wird, die Wiederaufnahme einer Funkressourcensteuerungs-(RRC-)Verbindung anzufordern, und der Nachrichtenauthentifizierungscode auf der Grundlage eines Integritätsschutzschlüssels des Endgeräts generiert wird; und

source: the sending unit 1002 is configured to send a notification message to a source base station if resuming of the RRC connection is rejected, where the notification message includes the message authentication code.
de_de: ist die Sendeeinheit 1002 konfiguriert, eine Benachrichtigungsnachricht an eine Quellbasisstation zu senden, falls die Wiederaufnahme der RRC-Verbindung abgelehnt wird, wobei die Benachrichtigungsnachricht den Nachrichtenauthentifizierungscode beinhaltet.

source: [0359] The notification message has one or more of the following functions:
de_de: [0359] Die Benachrichtigungsnachricht weist eine oder mehrere der folgenden Funktionen auf:

source: [0360] In a possible implementation, the context of the terminal that the notification message instructs to update includes an access stratum key.
de_de: [0360] Bei einer möglichen Implementierung enthält der Kontext des Endgeräts, den die Benachrichtigungsnachricht anweist, zu aktualisieren, einen Zugriffsschichtschlüssel.

source: [0361] In a possible implementation, the message authentication code is generated based on the freshness parameter and an integrity protection key of the terminal, and the context of the terminal that the notification message instructs to update includes the freshness parameter, where freshness parameters used to generate message authentication codes at two consecutive times are different.
de_de: [0361] Bei einer möglichen Implementierung wird der Nachrichtenauthentifizierungscode basierend auf dem Aktualitätsparameter und einem Integritätsschutzschlüssel des Endgeräts generiert, und der Endgerätekontext, den die Benachrichtigungsnachricht anweist, zu aktualisieren, beinhaltet den Aktualitätsparameter, wobei die Aktualitätsparameter, die zu zwei aufeinanderfolgenden Zeitpunkten zur Generierung von Nachrichtenauthentifizierungscodes verwendet werden, verschieden sind.

source: [0362] In a possible implementation, the connection resume request message further includes an indication parameter, the indication parameter is used to indicate the freshness parameter, and the notification message further includes the indication parameter.
de_de: [0362] Bei einer möglichen Implementierung beinhaltet die Verbindungswiederaufnahmeanforderungsnachricht ferner einen Anzeigeparameter, wobei der Anzeigeparameter dazu verwendet wird, den Aktualitätsparameter anzugeben, und die Benachrichtigungsnachricht beinhaltet ferner den Anzeigeparameter.

source: [0363] In a possible implementation, the freshness parameter includes a PDCP count, and the indication parameter includes some or all bits of the PDCP count.
de_de: [0363] Bei einer möglichen Implementierung beinhaltet der Aktualitätsparameter eine PDCP-Zählung, und der Anzeigeparameter beinhaltet einige oder alle Bits der PDCP-Zählung.

source: [0364] In a possible implementation, the freshness parameter includes a quantity of rejection times, and the quantity of rejection times is used to indicate a quantity of times for which resuming of the RRC connection that the apparatus attempts to perform is rejected.
de_de: [0364] Bei einer möglichen Implementierung beinhaltet der Aktualitätsparameter eine Anzahl von Ablehnungszeiten, und die Anzahl von Ablehnungszeiten wird verwendet, um anzugeben, wie oft die von der Vorrichtung versuchte Wiederaufnahme der RRC-Verbindung abgelehnt wird.

source: [0365] During implementation of another connection resume request method,
de_de: [0365] Bei der Implementierung eines weiteren Verbindungswiederaufnahmeanforderungsverfahrens

source: the receiving unit 1001 is configured to receive a connection resume request message from a terminal, where the connection resume request message includes a message authentication code; the message authentication code is generated based on a freshness parameter and an integrity protection key that is of the terminal, where freshness parameters used to generate message authentication codes at two consecutive times are different; and the connection resume request message is used to request to resume a radio resource control RRC connection; and
de_de: ist die Empfangseinheit 1001 konfiguriert, eine Verbindungswiederaufnahmeanforderungsnachricht von einem Endgerät zu empfangen, wobei die Verbindungswiederaufnahmeanforderungsnachricht einen Nachrichtenauthentifizierungscode beinhaltet; der Nachrichtenauthentifizierungscode auf der Grundlage eines Aktualitätsparameters und eines Integritätsschutzschlüssels des Endgeräts generiert wird, wobei Aktualitätsparameter, die zu zwei aufeinanderfolgenden Zeitpunkten zur Generierung von Nachrichtenauthentifizierungscodes verwendet werden, verschieden sind; und die Verbindungswiederaufnahmeanforderungsnachricht dazu dient, die Wiederaufnahme einer Funkressourcensteuerungs-(RRC-)Verbindung anzufordern; und

source: the sending unit 1002 is configured to send a context request message to a source base station if the RRC connection is resumed, where the context request message includes the message authentication code, and the context request message is used to request to obtain a context of the terminal.
de_de: ist die Sendeeinheit 1002 konfiguriert, eine Kontextanforderungsnachricht an eine Quellbasisstation zu senden, wobei die Kontextanforderungsnachricht den Nachrichtenauthentifizierungscode beinhaltet und die Kontextanforderungsnachricht dazu verwendet wird, den Erhalt eines Kontexts des Endgeräts anzufordern.

source: [0366] In a possible implementation, the connection resume request message further includes an indication parameter, the indication parameter is used to indicate the freshness parameter, and the context request message further includes the indication parameter.
de_de: [0366] Bei einer möglichen Implementierung enthält die Verbindungswiederaufnahmeanforderungsnachricht ferner einen Anzeigeparameter, der Anzeigeparameter wird verwendet, um den Aktualitätsparameter anzugeben, und die Kontextanforderungsnachricht enthält ferner den Anzeigeparameter.

source: [0367] In a possible implementation, the freshness parameter includes a packet data convergence protocol (PDCP) count, and the indication parameter includes some or all bits of the PDCP count.
de_de: [0367] In einer möglichen Implementierung beinhaltet der Aktualitätsparameter eine Paketdatenkonvergenzprotokoll-(PDCP-)Zählung, und der Anzeigeparameter beinhaltet einige oder alle Bits der PDCP-Zählung.

source: [0368] In a possible implementation, the freshness parameter includes a quantity of rejection times, and the quantity of rejection times is used to indicate a quantity of times for which resuming of the RRC connection that the apparatus attempts to perform is rejected.
de_de: [0368] Bei einer möglichen Implementierung beinhaltet der Aktualitätsparameter eine Anzahl von Ablehnungszeiten, und die Anzahl von Ablehnungszeiten wird verwendet, um anzugeben, wie oft die von der Vorrichtung versuchte Wiederaufnahme der RRC-Verbindung abgelehnt wird.

source: [0369] It should be understood that the target base station may be configured to implement the steps performed by the target base station in the method in the embodiments of the present invention.
de_de: [0369] Es versteht sich, dass die Zielbasisstation so konfiguriert sein kann, dass sie die Schritte implementiert, die von der Zielbasisstation in dem Verfahren in den Ausführungsformen der vorliegenden Erfindung durchgeführt werden.

source: [0370] In this application, function modules may be obtained through division in the source base station based on the foregoing method examples.
de_de: [0370] In dieser Anmeldung können Funktionsmodule durch Aufteilung in der Quellbasisstation basierend auf den vorgenannten Verfahrensbeispielen realisiert werden.

source: For example, when function modules are obtained through division in correspondence with functions, FIG. 11 is a schematic diagram of an apparatus.
de_de: Wenn beispielsweise Funktionsmodule durch Aufteilung entsprechend den Funktionen gebildet werden, so stellt Fig. 11 eine schematische Darstellung einer Vorrichtung dar.

source: The apparatus 1100 may be the source base station in the foregoing embodiments.
de_de: Die Vorrichtung 1100 kann in den vorstehenden Ausführungsformen die Zielbasisstation sein.

source: The apparatus 1100 includes a processing unit 1101, a receiving unit 1102, and a sending unit 1103.
de_de: Die Vorrichtung 1100 beinhaltet eine Verarbeitungseinheit 1101, eine Empfangseinheit 1102 und eine Sendeeinheit 1103.

source: [0371] During implementation of a connection resume request method,
de_de: [0371] Bei der Implementierung eines Verbindungswiederaufnahmeanforderungsverfahrens

source: the receiving unit 1102 is configured to receive a notification message from a target base station, where the notification message includes a message authentication code, and the message authentication code is generated based on an integrity protection key of a terminal; and
de_de: ist die Empfangseinheit 1102 konfiguriert, eine Benachrichtigungsnachricht von einer Zielbasisstation zu empfangen, wobei die Benachrichtigungsnachricht einen Nachrichtenauthentifizierungscode enthält und der Nachrichtenauthentifizierungscode auf der Grundlage eines Integritätsschutzschlüssels eines Endgeräts generiert wird; und

source: the processing unit 1101 is configured to check the message authentication code based on an integrity protection key of the source base station, and is configured to update a context of the terminal in the source base station if checking the message authentication code to be successful.
de_de: ist die Verarbeitungseinheit 1101 konfiguriert, den Nachrichtenauthentifizierungscode basierend auf einem Integritätsschutzschlüssel der Quellbasisstation zu überprüfen, und konfiguriert, einen Kontext des Endgeräts in der Quellbasisstation zu aktualisieren, falls die Überprüfung des Nachrichtenauthentifizierungscodes erfolgreich ist.

source: [0372] The notification message has one or more of the following functions:
de_de: [0372] Die Benachrichtigungsnachricht weist eine oder mehrere der folgenden Funktionen auf:

source: [0373] In a possible implementation, the processing unit 1101 is specifically configured to update an access stratum key in the context of the terminal in the source base station.
de_de: [0373] Bei einer möglichen Implementierung ist die Verarbeitungseinheit 1101 im Speziellen konfiguriert, einen Zugriffsschichtschlüssel in dem Kontext des Endgeräts in der Quellbasisstation zu aktualisieren.

source: [0374] In a possible implementation, the message authentication code is generated based on a freshness parameter and an integrity protection key that is of the terminal, where freshness parameters used to generate message authentication codes at two consecutive times are different; and
de_de: [0374] Bei einer möglichen Implementierung wird der Nachrichtenauthentifizierungscode basierend auf einem Aktualitätsparameter und einem Integritätsschutzschlüssel des Endgeräts generiert, wobei die Aktualitätsparameter, die zum Generieren von Nachrichtenauthentifizierungscodes zu zwei aufeinanderfolgenden Zeitpunkten verwendet werden, verschieden sind; und

source: the processing unit 1101 is specifically configured to check the message authentication code based on the freshness parameter and an integrity protection key that is of the source base station.
de_de: Die Verarbeitungseinheit 1101 ist im Speziellen konfiguriert, den Nachrichtenauthentifizierungscode basierend auf dem Aktualitätsparameter und einem Integritätsschutzschlüssel der Quellbasisstation zu überprüfen.

source: [0375] In a possible implementation, the notification message further includes an indication parameter, and the indication parameter is used to indicate the freshness parameter.
de_de: [0375] Bei einer möglichen Implementierung beinhaltet die Benachrichtigungsnachricht ferner einen Anzeigeparameter, und der Anzeigeparameter wird verwendet, um den Aktualitätsparameter anzuzeigen.

source: [0376] In a possible implementation, the freshness parameter includes a packet data convergence protocol count (PDCP count).
de_de: [0376] Bei einer möglichen Implementierung beinhaltet der Aktualitätsparameter eine Paketdatenkonvergenzprotokoll-Zählung (PDCP-Zählung).

source: That the processing unit 1101 is configured to update the context of the terminal in the source base station specifically includes:
de_de: Die Tatsache, dass die Verarbeitungseinheit 1101 konfiguriert ist, den Kontext des Endgeräts in der Quellbasisstation zu aktualisieren, beinhaltet insbesondere:

source: updating, if a value of the PDCP count is greater than a value of a PDCP count in the context of the terminal, the value of the PDCP count in the context of the terminal to the value of the PDCP count indicated by the indication parameter.
de_de: Aktualisieren des Werts der PDCP-Zählung im Kontext des Endgeräts auf den durch den Anzeigeparameter angegebenen Wert der PDCP-Zählung, falls ein Wert der PDCP-Zählung größer als ein Wert einer PDCP-Zählung im Kontext des Endgeräts ist.
